JMeterTestCases.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Event vs Controller">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Benutzer definierte Variablen">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread-Gruppe">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Schleifen-Controller (Loop Controller)">
          <stringProp name="LoopController.loops">200</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.path">http://localhost:8080/api/user-event</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;id&quot;: 2,&#xd;
    &quot;firstName&quot;: &quot;Max&quot;,&#xd;
    &quot;lastName&quot;: &quot;Mustermann&quot;,&#xd;
    &quot;email&quot;: &quot;max@example.com&quot;,&#xd;
    &quot;payload&quot;: &quot;{\&quot;action\&quot;:\&quot;UPDATED\&quot;,\&quot;details\&quot;:\&quot;Changed email\&quot;}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">resultController</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <com.zeroclue.jmeter.protocol.amqp.AMQPPublisher guiclass="com.zeroclue.jmeter.protocol.amqp.gui.AMQPPublisherGui" testclass="com.zeroclue.jmeter.protocol.amqp.AMQPPublisher" testname="AMQP Publisher">
          <stringProp name="AMQPSampler.Exchange">jmeterExchange</stringProp>
          <stringProp name="AMQPSampler.ExchangeType">direct</stringProp>
          <boolProp name="AMQPSampler.ExchangeDurable">true</boolProp>
          <boolProp name="AMQPSampler.ExchangeRedeclare">false</boolProp>
          <boolProp name="AMQPSampler.ExchangeAutoDelete">false</boolProp>
          <stringProp name="AMQPSampler.Queue">user-profile</stringProp>
          <stringProp name="AMQPSampler.RoutingKey">user-profile</stringProp>
          <stringProp name="AMQPSampler.QueueDurable">true</stringProp>
          <boolProp name="AMQPSampler.Redeclare">false</boolProp>
          <stringProp name="AMQPSampler.QueueAutoDelete">false</stringProp>
          <stringProp name="AMQPSampler.QueueExclusive">false</stringProp>
          <stringProp name="AMQPSampler.VirtualHost">/</stringProp>
          <stringProp name="AMQPSampler.Host">localhost</stringProp>
          <stringProp name="AMQPSampler.Port">5672</stringProp>
          <stringProp name="AMQPSampler.Username">guest</stringProp>
          <stringProp name="AMQPSampler.Password">guest</stringProp>
          <stringProp name="AMQPSampler.Timeout">1000</stringProp>
          <stringProp name="AMQPSampler.Heartbeat">60</stringProp>
          <stringProp name="AMQPSampler.SSL">false</stringProp>
          <stringProp name="AMQPSampler.Iterations">1</stringProp>
          <boolProp name="AMQPPublisher.Persistent">true</boolProp>
          <boolProp name="AMQPPublisher.UseTx">false</boolProp>
          <stringProp name="AMQPPublisher.MessageRoutingKey">user-profile</stringProp>
          <stringProp name="AMQPPublisher.Message">{
    &quot;id&quot;: 2,
    &quot;firstName&quot;: &quot;Max&quot;,
    &quot;lastName&quot;: &quot;Mustermann&quot;,
    &quot;email&quot;: &quot;max@example.com&quot;,
    &quot;payload&quot;: &quot;{\&quot;action\&quot;:\&quot;UPDATED\&quot;,\&quot;details\&quot;:\&quot;Changed email\&quot;}&quot;
}</stringProp>
          <stringProp name="AMQPPublisher.ContentType">application/json</stringProp>
          <stringProp name="AMQPPublisher.ContentEncoding">utf-8</stringProp>
          <boolProp name="AMQPPublisher.Timestamp">true</boolProp>
          <elementProp name="AMQPPublisher.Headers" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Benutzer definierte Variablen">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </com.zeroclue.jmeter.protocol.amqp.AMQPPublisher>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <stringProp name="filename">resultQueue.csv</stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>